# Differences between SQL and No-SQL Databases
  **SQL Databases**


*   Are primarily called Relational Databases.
*   Vertically scalable.
*   Better for multi-row transactions as they are table-based
*   Have fixed or static predefined schema.
*   Not suited for hierarchical data storage.
*   Best suited for complex queries
*   Follows ACID property(Atomicity, Consistency, Isolation, Durability)

**No-SQL Databases**

*   Are primarily called non-relational/distributed databses
*   Horizontally scalable.
*   Better for unstructured data like documents or JSON.
*   Have a dynamic schema.
*   Best suited for hierarchical data storage.
*   Not so good for complex queries.
*   Follows CAP property(Consistency, Availability, Partition).

**Loading SQL Extension**

In [1]:
%load_ext sql

**Creating and Loading abc_data database**

In [2]:
%sql sqlite:///abc_data.db


1. **Customers' Table**

In [3]:
%%sql CREATE TABLE customers(
    customer_id INT NOT NULL PRIMARY KEY,
    first_name VARCHAR(15),
    last_name VARCHAR(15),
    email VARCHAR(30) UNIQUE
)

 * sqlite:///abc_data.db
Done.

[]

In [4]:
%sql PRAGMA table_info("customers");

 * sqlite:///abc_data.db
Done.

[(0, 'customer_id', 'INT', 1, None, 1),
 (1, 'first_name', 'VARCHAR(15)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(15)', 0, None, 0),
 (3, 'email', 'VARCHAR(30)', 0, None, 0)]

In [5]:
%%sql INSERT INTO customers (customer_id, first_name, last_name, email)VALUES
        (1, 'John', 'Doe', 'johndoe@email.com'),
        (2, 'Jane', 'Smith', 'janesmith@email.com'),
        (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
        (4, 'Alice', 'Brown', 'alicebrown@email.com'),
        (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
        (6, 'Eva', 'Fisher', 'evafisher@email.com'),
        (7, 'George', 'Harris', 'georgeharris@email.com'),
        (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
        (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
        (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
        (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
        (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
        (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///abc_data.db
13 rows affected.

[]

In [6]:
%%sql
SELECT *
FROM customers

 * sqlite:///abc_data.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]



2.   **Products' Table**

In [7]:
%%sql CREATE TABLE products(
    product_id INT PRIMARY KEY,
    product_name VARCHAR(20) UNIQUE,
    price DOUBLE(4, 2)
)

 * sqlite:///abc_data.db
Done.

[]

In [8]:
%sql PRAGMA table_info("products");

 * sqlite:///abc_data.db
Done.

[(0, 'product_id', 'INT', 0, None, 1),
 (1, 'product_name', 'VARCHAR(20)', 0, None, 0),
 (2, 'price', 'DOUBLE(4, 2)', 0, None, 0)]

In [9]:
%%sql INSERT INTO products (product_id, product_name, price)VALUES
        (1, 'Product A', 10.00),
        (2, 'Product B', 15.00),
        (3, 'Product C', 20.00),
        (4, 'Product D', 25.00),
        (5, 'Product E', 30.00),
        (6, 'Product F', 35.00),
        (7, 'Product G', 40.00),
        (8, 'Product H', 45.00),
        (9, 'Product I', 50.00),
        (10, 'Product J', 55.00),
        (11, 'Product K', 60.00),
        (12, 'Product L', 65.00),
        (13, 'Product M', 70.00);

 * sqlite:///abc_data.db
13 rows affected.

[]

In [10]:
%%sql
SELECT *
FROM products

 * sqlite:///abc_data.db
Done.

[(1, 'Product A', 10.0),
 (2, 'Product B', 15.0),
 (3, 'Product C', 20.0),
 (4, 'Product D', 25.0),
 (5, 'Product E', 30.0),
 (6, 'Product F', 35.0),
 (7, 'Product G', 40.0),
 (8, 'Product H', 45.0),
 (9, 'Product I', 50.0),
 (10, 'Product J', 55.0),
 (11, 'Product K', 60.0),
 (12, 'Product L', 65.0),
 (13, 'Product M', 70.0)]

**3. Orders' Table**

In [11]:
%%sql CREATE TABLE orders(
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE
)

 * sqlite:///abc_data.db
Done.

[]

**Inserting into the orders table.**

In [12]:
%%sql INSERT INTO orders (order_id,customer_id,order_date)VALUES
(1, 1,'2023-05-01'),
(2, 2,'2023-05-02'),
(3, 3,'2023-05-03'),
(4, 1,'2023-05-04'),
(5, 2,'2023-05-05'),
(6, 3,'2023-05-06'),
(7, 4,'2023-05-07'),
(8, 5,'2023-05-08'),
(9, 6,'2023-05-09'),
(10,7,'2023-05-10'),
(11,8,'2023-05-11'),
(12,9,'2023-05-12'),
(13,10,'2023-05-13'),
(14,11,'2023-05-14'),
(15,12,'2023-05-15'),
(16,13,'2023-05-16');

 * sqlite:///abc_data.db
16 rows affected.

[]

In [13]:
%%sql
SELECT *
FROM orders

 * sqlite:///abc_data.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]


4.   **Order_items' Table**

In [14]:
%%sql CREATE TABLE order_items(
    order_id INT NOT NULL,
    product_id INT,
    quantity INT
)

 * sqlite:///abc_data.db
Done.

[]

In [15]:
%sql PRAGMA table_info("order_items");

 * sqlite:///abc_data.db
Done.

[(0, 'order_id', 'INT', 1, None, 0),
 (1, 'product_id', 'INT', 0, None, 0),
 (2, 'quantity', 'INT', 0, None, 0)]

**Inserting into order_items table.**

In [16]:
%%sql INSERT INTO order_items (order_id,product_id,quantity)VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///abc_data.db
32 rows affected.

[]

In [17]:
%%sql
SELECT *
FROM order_items

 * sqlite:///abc_data.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

In [18]:
%sql SELECT * FROM sqlite_master WHERE type='table';

 * sqlite:///abc_data.db
Done.

[('table', 'customers', 'customers', 2, 'CREATE TABLE customers(\n    customer_id INT NOT NULL PRIMARY KEY,\n    first_name VARCHAR(15),\n    last_name VARCHAR(15),\n    email VARCHAR(30) UNIQUE\n)'),
 ('table', 'products', 'products', 5, 'CREATE TABLE products(\n    product_id INT PRIMARY KEY,\n    product_name VARCHAR(20) UNIQUE,\n    price DOUBLE(4, 2)\n)'),
 ('table', 'orders', 'orders', 8, 'CREATE TABLE orders(\n    order_id INT PRIMARY KEY,\n    customer_id INT,\n    order_date DATE\n)'),
 ('table', 'order_items', 'order_items', 10, 'CREATE TABLE order_items(\n    order_id INT NOT NULL,\n    product_id INT,\n    quantity INT\n)')]

**Day 3 Challenge**

**1. Which product has the highest price? Only return a single row.**

In [19]:
%%sql
SELECT product_name,price
FROM products
ORDER BY price DESC
LIMIT 1;

 * sqlite:///abc_data.db
Done.

[('Product M', 70.0)]

**2. Which order_id had the highest number of items in terms of quantity**

In [20]:
%%sql
SELECT order_id,quantity
FROM order_items
ORDER BY quantity DESC
LIMIT 1;

 * sqlite:///abc_data.db
Done.

[(4, 4)]

**Day 4 Challenge**

**1. Which customer has made the most orders?**

In [78]:
%%sql SELECT order_counts as (
      SELECT customer_id, count(order_id) AS order_count
      FROM orders
      GROUP BY customer_id),
      max_order_count AS (
      SELECT max(order_count) as max_count
      FROM order_counts )
      SELECT c.first_name, c.last_name
      FROM customers c
      JOIN order_counts oc ON c.customer_id = oc.customer_id
      JOIN max_order_count moc ON oc.order_count = moc.max_count;

 * sqlite:///abc_data.db
(sqlite3.OperationalError) near "(": syntax error
[SQL: SELECT order_counts as (
      SELECT customer_id, count(order_id) AS order_count
      FROM orders
      GROUP BY customer_id),
      max_order_count AS (
      SELECT max(order_count) as max_count
      FROM order_counts )
      SELECT c.first_name, c.last_name
      FROM customers c
      JOIN order_counts oc ON c.customer_id = oc.customer_id
      JOIN max_order_count moc ON oc.order_count = moc.max_count;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**2. What is the total revenue per product?**

In [35]:
%%sql SELECT products.product_name,
        products.price * sum(quantity) AS total_revenue
        FROM products
        JOIN order_items oi ON oi.product_id = products.product_id
        GROUP BY products.product_name,products.price
        ORDER BY 2 desc;

 * sqlite:///abc_data.db
Done.

[('Product M', 420.0),
 ('Product J', 330.0),
 ('Product F', 210.0),
 ('Product L', 195.0),
 ('Product K', 180.0),
 ('Product C', 160.0),
 ('Product I', 150.0),
 ('Product B', 135.0),
 ('Product H', 135.0),
 ('Product G', 120.0),
 ('Product E', 90.0),
 ('Product D', 75.0),
 ('Product A', 50.0)]

**Day 5 Challenge**

**1. Find the first order (by date) for each customer.**

In [41]:
%%sql SELECT
first_name,
last_name,
price FROM orders
JOIN order_items oi on oi.order_id = orders.order_id
JOIN products p on p.product_id = oi.product_id
JOIN customers c on c.customer_id = orders.customer_id
WHERE price = (SELECT DATETIME('order_date') FROM orders );

 * sqlite:///abc_data.db
Done.

[]

**2. What is the total revenue per product?**

In [44]:
%%sql SELECT products.product_name,
        products.price * sum(quantity) AS total_revenue
        FROM products
        JOIN order_items oi ON oi.product_id = products.product_id
        GROUP BY products.product_name,products.price
        ORDER BY 2 desc;

 * sqlite:///abc_data.db
Done.

[('Product M', 420.0),
 ('Product J', 330.0),
 ('Product F', 210.0),
 ('Product L', 195.0),
 ('Product K', 180.0),
 ('Product C', 160.0),
 ('Product I', 150.0),
 ('Product B', 135.0),
 ('Product H', 135.0),
 ('Product G', 120.0),
 ('Product E', 90.0),
 ('Product D', 75.0),
 ('Product A', 50.0)]

**3. Find the day with the highest revenue.**

In [48]:
%%sql
SELECT price,order_date
FROM products,orders
ORDER BY price DESC
LIMIT 1;

 * sqlite:///abc_data.db
Done.

[(70.0, '2023-05-01')]